NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    RtcmEspNowCommonHeader common{};
    std::memcpy(&common, data, sizeof(common));
    if (common.magic != RTCM_ESPNOW_MAGIC || common.version != RTCM_ESPNOW_VERSION) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_PAIR_RESPONSE) {
        queuePairResponse(sourceMac, data, length);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_ROVER_LLH_STATUS) {
        if (length != static_cast<int>(sizeof(RoverLlhStatusPacket))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }
        RoverLlhStatusPacket packet{};
        std::memcpy(&packet, data, sizeof(packet));
        if (!rtcmEspNowValidateRoverLlhStatus(packet, sizeof(packet))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }

        size_t ignoredIndex = 0;
        if (!findRoverPeerIndex(sourceMac, ignoredIndex)) {
            incrementStat(&BaseEspnowStats::llhStatusUnknownSource);
            return;
        }
        if (!storeLatestRoverLlh(sourceMac, nullptr, false,
                                 packet.sequence,
                                 packet.latitudeE7,
                                 packet.longitudeE7,
                                 packet.heightMm)) {
            incrementStat(&BaseEspnowStats::llhStatusCapacityDrops);
            return;
        }
        incrementStat(&BaseEspnowStats::llhStatusReceived);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_RELAYED_ROVER_LLH_STATUS) {
        if (length != static_cast<int>(sizeof(RelayedRoverLlhStatusPacket))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }
        RelayedRoverLlhStatusPacket packet{};
        std::memcpy(&packet, data, sizeof(packet));
        if (!rtcmEspNowValidateRelayedRoverLlhStatus(packet, sizeof(packet))) {
            incrementStat(&BaseEspnowStats::llhStatusInvalid);
            return;
        }
        size_t ignoredIndex = 0;
        if (!findRoverPeerIndex(sourceMac, ignoredIndex)) {
            incrementStat(&BaseEspnowStats::llhStatusUnknownSource);
            return;
        }
        if (!storeLatestRoverLlh(packet.roverMac, sourceMac, true,
                                 packet.sequence,
                                 packet.latitudeE7,
                                 packet.longitudeE7,
                                 packet.heightMm)) {
            incrementStat(&BaseEspnowStats::llhStatusCapacityDrops);
            return;
        }
        incrementStat(&BaseEspnowStats::llhStatusReceived);
        incrementStat(&BaseEspnowStats::llhStatusRelayedReceived);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_GNSS_COMMAND_RESULT) {
        if (length != static_cast<int>(sizeof(GnssCommandResultPacket))) {
            incrementStat(&BaseEspnowStats::gnssCommandInvalidResults);
            return;
        }
        GnssCommandResultPacket packet{};
        std::memcpy(&packet, data, sizeof(packet));
        size_t ignoredIndex = 0;
        if (!findRoverPeerIndex(sourceMac, ignoredIndex) ||
            !rtcmEspNowValidateGnssCommandResult(packet,
                                                 sizeof(packet),
                                                 ESPNOW_NETWORK_ID,
                                                 ESPNOW_PAIRING_KEY,
                                                 sizeof(ESPNOW_PAIRING_KEY))) {
            incrementStat(&BaseEspnowStats::gnssCommandInvalidResults);
            return;
        }

        bool matches = false;
        portENTER_CRITICAL(&gnssCommandMux);
        matches = waitingForGnssCommandResult &&
                  macEquals(sourceMac, expectedGnssCommandMac) &&
                  packet.transactionId == expectedGnssCommandTransactionId &&
                  packet.commandId == expectedGnssCommandId;
        portEXIT_CRITICAL(&gnssCommandMux);
        if (!matches) {
            incrementStat(&BaseEspnowStats::gnssCommandInvalidResults);
            return;
        }

        BaseGnssCommandResultEvent event{};
        std::memcpy(event.roverMac, sourceMac, sizeof(event.roverMac));
        event.transactionId = packet.transactionId;
        event.commandId = packet.commandId;
        event.status = packet.status;
        event.completedStep = packet.completedStep;
        event.totalSteps = packet.totalSteps;
        event.detailCode = packet.detailCode;
        event.receivedAtMs = millis();
        if (gnssCommandResultQueue != nullptr &&
            xQueueSend(gnssCommandResultQueue, &event, 0) != pdTRUE) {
            BaseGnssCommandResultEvent discarded{};
            xQueueReceive(gnssCommandResultQueue, &discarded, 0);
            xQueueSend(gnssCommandResultQueue, &event, 0);
        }
        incrementStat(&BaseEspnowStats::gnssCommandResults);
        if (packet.status == RTCM_ESPNOW_GNSS_COMMAND_STATUS_UART_SEQUENCE_WRITTEN) {
            const bool enableRtcm =
                packet.commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER;
            setRoverRtcmEnabled(sourceMac, enableRtcm);
            Serial.printf("[BASE][GNSS_CMD] RTCM delivery %s for peer %s action=%s\n",
                          enableRtcm ? "enabled" : "disabled",
                          macToString(sourceMac).c_str(),
                          gnssCommandName(packet.commandId));
        }
        if (gnssCommandResultSemaphore != nullptr) {
            xSemaphoreGive(gnssCommandResultSemaphore);
        }
        return;
    }

    if (length != static_cast<int>(sizeof(RtcmEspNowAck))) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    RtcmEspNowAck ack{};
    std::memcpy(&ack, data, sizeof(ack));
    if (ack.packetType != RTCM_ESPNOW_PACKET_TYPE_FRAME_ACK ||
        ack.status != RTCM_ESPNOW_ACK_STATUS_WRITTEN) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    if (!waitingForFrameAck || !macEquals(sourceMac, expectedAckMac) ||
        ack.streamId != expectedAckStreamId ||
        ack.frameSequence != expectedAckSequence) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    incrementStat(&BaseEspnowStats::ackPacketsReceived);
    if (frameAckSemaphore != nullptr) {
        xSemaphoreGive(frameAckSemaphore);
    }
}

bool frameDeadlineExpired(uint32_t startedAt)
{
    return millis() - startedAt >= ESPNOW_FRAME_SEND_DEADLINE_MS;
}

