NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    bool resultReceived = false;
    for (uint8_t attempt = 0;
         attempt <= ESPNOW_GNSS_COMMAND_SEND_RETRY_COUNT && !resultReceived;
         ++attempt) {
        if (!sendControlPacket(command.roverMac,
                               reinterpret_cast<const uint8_t*>(&packet),
                               sizeof(packet))) {
            Serial.printf("[BASE][GNSS_CMD][WARN] Radio send failed txn=%lu attempt=%u\n",
                          static_cast<unsigned long>(command.transactionId),
                          attempt + 1);
            delay(20);
            continue;
        }
        incrementStat(&BaseEspnowStats::gnssCommandSent);
        Serial.printf("[BASE][GNSS_CMD] Sent action=%s txn=%lu rover=%s duration_s=%lu attempt=%u\n",
                      gnssCommandName(command.commandId),
                      static_cast<unsigned long>(command.transactionId),
                      macToString(command.roverMac).c_str(),
                      static_cast<unsigned long>(command.surveyDurationSeconds),
                      attempt + 1);
        resultReceived =
            xSemaphoreTake(gnssCommandResultSemaphore,
                           pdMS_TO_TICKS(ESPNOW_GNSS_COMMAND_RESULT_TIMEOUT_MS)) == pdTRUE;
    }

    portENTER_CRITICAL(&gnssCommandMux);
    waitingForGnssCommandResult = false;
    portEXIT_CRITICAL(&gnssCommandMux);
    if (!resultReceived) {
        incrementStat(&BaseEspnowStats::gnssCommandTimeouts);
        queueLocalGnssCommandTimeout(command);
        Serial.printf("[BASE][GNSS_CMD][ERROR] Result timeout txn=%lu rover=%s\n",
                      static_cast<unsigned long>(command.transactionId),
                      macToString(command.roverMac).c_str());
    }
}
}

bool setupEspNowBase()
{
    sendCallbackSemaphore = xSemaphoreCreateBinary();
    frameAckSemaphore = xSemaphoreCreateBinary();
    espnowSendMutex = xSemaphoreCreateMutex();
    gnssCommandResultSemaphore = xSemaphoreCreateBinary();
    gnssCommandQueue = xQueueCreate(ESPNOW_GNSS_COMMAND_QUEUE_LENGTH,
                                    sizeof(QueuedGnssCommand));
    gnssCommandResultQueue = xQueueCreate(ESPNOW_GNSS_COMMAND_RESULT_QUEUE_LENGTH,
                                          sizeof(BaseGnssCommandResultEvent));
    if (sendCallbackSemaphore == nullptr || frameAckSemaphore == nullptr ||
        espnowSendMutex == nullptr || gnssCommandResultSemaphore == nullptr ||
        gnssCommandQueue == nullptr || gnssCommandResultQueue == nullptr) {
        Serial.println("[BASE][ESP-NOW][ERROR] Failed to create semaphores");
        return false;
    }

    setupPairingButton();

    WiFi.mode(WIFI_STA);
    WiFi.disconnect(false, true);
    delay(50);
    if (!configureMaxTxPower()) {
        return false;
    }

    esp_wifi_set_ps(WIFI_PS_NONE);

    uint8_t protocol = WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N;
#ifdef WIFI_PROTOCOL_LR
    if (ESPNOW_USE_LR_250KBPS) {
        protocol |= WIFI_PROTOCOL_LR;
    }
#endif
    esp_wifi_set_protocol(WIFI_IF_STA, protocol);

    esp_err_t result = esp_wifi_set_channel(ESPNOW_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_wifi_set_channel failed: %d\n", result);
        return false;
    }

    result = esp_now_init();
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_init failed: %d\n", result);
        return false;
    }

    result = esp_now_register_send_cb(onDataSent);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] register send callback failed: %d\n", result);
        return false;
    }
    result = esp_now_register_recv_cb(onDataReceived);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] register receive callback failed: %d\n", result);
        return false;
    }

    if (ESPNOW_ENCRYPTION_ENABLED) {
        result = esp_now_set_pmk(ESPNOW_PMK);
        if (result != ESP_OK) {
            Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_set_pmk failed: %d\n", result);
            return false;
        }
    }

    if (ESPNOW_PAIRING_ENABLED) {
        addEspNowPeer(BROADCAST_MAC, false);
    }
    loadStoredRovers();
    updatePeerStats();
    const BaseEspnowStats loadedPeerStats = getBaseEspnowStats();
    if (loadedPeerStats.activeRoverCount == 0) {
        if (ESPNOW_PAIRING_ENABLED) {
            Serial.println("[BASE][PAIR][WARN] No Rover MAC in NVS; hold pairing button to pair");
        } else {
            Serial.println("[BASE][ESP-NOW][ERROR] No Rover MAC in NVS and pairing disabled");
            return false;
        }
    }

#if defined(WIFI_PHY_RATE_LORA_250K)
    if (ESPNOW_USE_LR_250KBPS) {
        result = esp_wifi_config_espnow_rate(WIFI_IF_STA, WIFI_PHY_RATE_LORA_250K);
        if (result != ESP_OK) {
            Serial.printf("[BASE][ESP-NOW][WARN] espnow LR rate config failed: %d\n", result);
        }
    }
#endif

    streamId = static_cast<uint16_t>(esp_random() & 0xFFFFU);

    Serial.println("[WIFI] STA radio ready for ESP-NOW; Internet transport starts separately");
    Serial.print("[WIFI] Local STA MAC: ");
    Serial.println(WiFi.macAddress());
    Serial.printf("[WIFI] ESP-NOW fixed channel: %u\n", ESPNOW_WIFI_CHANNEL);
    updatePeerStats();
    const BaseEspnowStats setupStats = getBaseEspnowStats();
    Serial.printf("[BASE][ESP-NOW] Ready, channel=%u, LR=%s, streamId=%u, rover_count=%lu\n",
                  ESPNOW_WIFI_CHANNEL,
                  ESPNOW_USE_LR_250KBPS ? "250 Kbps" : "off",
                  streamId,
                  static_cast<unsigned long>(setupStats.activeRoverCount));

    return true;
}

void baseEspNowLoop()
{
    if constexpr (ESPNOW_PAIRING_ENABLED) {
        static uint32_t pressedSinceMs = 0;
        static bool pairingStartHandled = false;
        const bool rawLevel = digitalRead(PAIRING_BUTTON_PIN) == HIGH;
        const bool pressed = PAIRING_BUTTON_ACTIVE_LOW ? !rawLevel : rawLevel;
        const uint32_t now = millis();

        if (pressed) {
            if (pressedSinceMs == 0) {
                pressedSinceMs = now;
            } else if (!pairingStartHandled &&
                       now - pressedSinceMs >= PAIRING_BUTTON_HOLD_MS) {
                startPairingMode();
                pairingStartHandled = true;
            }
        } else {
            pressedSinceMs = 0;
            pairingStartHandled = false;
        }

        bool active = false;
        uint32_t endsAt = 0;
        portENTER_CRITICAL(&pairingMux);
        active = pairingActive;
        endsAt = pairingEndsAtMs;
        portEXIT_CRITICAL(&pairingMux);
        if (active && static_cast<int32_t>(now - endsAt) >= 0) {
            stopPairingMode("timeout");
        }

        sendPairDiscoveryIfDue();
        processPendingPairResponse();
    }
    processNextGnssCommand();
}

