NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
bool baseEspNowSendRtcmFrame(const uint8_t* frame, size_t length)
{
    if (frame == nullptr || length < 6 || length > RTCM_ESPNOW_MAX_FRAME_LENGTH) {
        incrementStat(&BaseEspnowStats::framesDropped);
        return false;
    }

    const uint8_t fragmentCount = static_cast<uint8_t>(
        (length + RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD - 1) / RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD);
    if (fragmentCount == 0 || fragmentCount > RTCM_ESPNOW_MAX_FRAGMENT_COUNT) {
        incrementStat(&BaseEspnowStats::framesDropped);
        return false;
    }

    RoverPeer peers[ESPNOW_MAX_PAIRED_ROVERS] = {};
    const size_t peerCount = copyRoverPeers(peers, ESPNOW_MAX_PAIRED_ROVERS);
    if (peerCount == 0) {
        incrementStat(&BaseEspnowStats::framesDropped);
        Serial.println("[BASE][ESP-NOW][WARN] Drop RTCM frame: no paired Rover peer");
        return false;
    }

    const uint32_t currentSequence = frameSequence;
    const uint32_t sendStartedAt = millis();
    bool allPeersAcked = true;
    size_t attemptedPeers = 0;

    for (size_t index = 0; index < peerCount; ++index) {
        if (!peers[index].rtcmEnabled) {
            continue;
        }
        ++attemptedPeers;
        if (!sendFrameToPeer(peers[index].mac, frame, length, currentSequence)) {
            allPeersAcked = false;
            Serial.printf("[BASE][ESP-NOW][ERROR] Drop seq=%lu for peer=%s without application ACK\n",
                          static_cast<unsigned long>(currentSequence),
                          macToString(peers[index].mac).c_str());
        }
    }

    waitingForFrameAck = false;
    if (attemptedPeers == 0) {
        incrementStat(&BaseEspnowStats::framesDropped);
        const uint32_t now = millis();
        if (lastNoRtcmPeerWarningAtMs == 0 ||
            now - lastNoRtcmPeerWarningAtMs >= HEALTH_INTERVAL) {
            lastNoRtcmPeerWarningAtMs = now;
            Serial.println("[BASE][ESP-NOW][WARN] Drop RTCM frame: no RTCM-enabled Rover peer");
        }
        return false;
    }
    ++frameSequence;
    recordFrameSendDuration(millis() - sendStartedAt);

    if (allPeersAcked) {
        incrementStat(&BaseEspnowStats::framesSent);
        return true;
    }

    incrementStat(&BaseEspnowStats::framesDropped);
    return false;
}

BaseEspnowStats getBaseEspnowStats()
{
    updatePeerStats();
    portENTER_CRITICAL(&statsMux);
    const BaseEspnowStats copy = stats;
    portEXIT_CRITICAL(&statsMux);
    return copy;
}

uint16_t getBaseEspNowStreamId()
{
    return streamId;
}

size_t baseEspNowCopyLatestRoverLlh(BaseRoverLlhStatus* destination,
                                    size_t capacity)
{
    if (destination == nullptr || capacity == 0) {
        return 0;
    }
    const size_t count = ESPNOW_MAX_LLH_SOURCES < capacity
                             ? ESPNOW_MAX_LLH_SOURCES
                             : capacity;
    portENTER_CRITICAL(&llhMux);
    for (size_t index = 0; index < count; ++index) {
        destination[index] = latestRoverLlh[index];
    }
    portEXIT_CRITICAL(&llhMux);
    return count;
}

static BaseGnssCommandQueueResult queueFirstRoverGnssCommand(
    uint8_t commandId,
    uint32_t transactionId,
    uint32_t surveyDurationSeconds,
    uint8_t targetMac[6])
{
    const bool validArguments =
        transactionId != 0 &&
        ((commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN &&
          surveyDurationSeconds >= RTCM_ESPNOW_GNSS_SURVEY_MIN_SECONDS &&
          surveyDurationSeconds <= RTCM_ESPNOW_GNSS_SURVEY_MAX_SECONDS) ||
         (commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER &&
          surveyDurationSeconds == 0));
    if (!validArguments) {
        return BaseGnssCommandQueueResult::InvalidArgument;
    }
    if (gnssCommandQueue == nullptr) {
        return BaseGnssCommandQueueResult::NotReady;
    }

    QueuedGnssCommand command{};
    portENTER_CRITICAL(&peerMux);
    if (roverPeerCount > 0) {
        std::memcpy(command.roverMac, roverPeers[0].mac, sizeof(command.roverMac));
    }
    portEXIT_CRITICAL(&peerMux);
    if (!macIsConfigured(command.roverMac)) {
        return BaseGnssCommandQueueResult::NoPairedRover;
    }
    command.transactionId = transactionId;
    command.surveyDurationSeconds = surveyDurationSeconds;
    command.commandId = commandId;
    if (xQueueSend(gnssCommandQueue, &command, 0) != pdTRUE) {
        return BaseGnssCommandQueueResult::QueueFull;
    }
    if (targetMac != nullptr) {
        std::memcpy(targetMac, command.roverMac, 6);
    }
    incrementStat(&BaseEspnowStats::gnssCommandQueued);
    return BaseGnssCommandQueueResult::Queued;
}

BaseGnssCommandQueueResult baseEspNowQueueFirstRoverBaseSurveyIn(
    uint32_t transactionId,
    uint32_t surveyDurationSeconds,
    uint8_t targetMac[6])
{
    return queueFirstRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_SURVEY_IN,
        transactionId,
        surveyDurationSeconds,
        targetMac);
}

BaseGnssCommandQueueResult baseEspNowQueueFirstRoverMode(
    uint32_t transactionId,
    uint8_t targetMac[6])
{
    return queueFirstRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER,
        transactionId,
        0,
        targetMac);
}

bool baseEspNowPopGnssCommandResult(BaseGnssCommandResultEvent& result)
{
    return gnssCommandResultQueue != nullptr &&
           xQueueReceive(gnssCommandResultQueue, &result, 0) == pdTRUE;
}

const char* baseGnssCommandQueueResultToString(BaseGnssCommandQueueResult result)
{
    switch (result) {
    case BaseGnssCommandQueueResult::Queued: return "queued";
    case BaseGnssCommandQueueResult::InvalidArgument: return "invalid_argument";
    case BaseGnssCommandQueueResult::NotReady: return "not_ready";
    case BaseGnssCommandQueueResult::NoPairedRover: return "no_paired_rover";
    case BaseGnssCommandQueueResult::QueueFull: return "queue_full";
    default: return "unknown";
    }
}
